[
  {
    "title": "Merging Guest profiles.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Rooms Assignment/Blocking",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "DNM Room Status",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Copying a Reservation/Add On reservation",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Reservation Routing/Company/TA/GST",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Iforms making procedure",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Advance Deposit/Advance payments",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Reinstate Process",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Departure Calling.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Mass cancellations",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing payment instructions",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Viewing routing instructions",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Posting advance deposit",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Reprinting Deposit Receipts",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Detaching Deposit Payments",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check in process for FIT travelers.",
    "content": "<h2>Objective</h2><p>To ensure all Free individual travellers are given a flawless checkin experience and a well-executed check-in experience fosters trust and establishes a foundation for an enjoyable stay with us.</p><h2>Process Explained</h2><p>Ensure the reservation is confirmed and details are verified. Cross-check guest details (name, booking reference, etc.) to avoid confusion.\nBe aware of any special requests (e.g., room preferences, allergies).Greet the guest with a warm, professional, and friendly demeanor.Politely ask for valid identification (passport, ID card) if needed for security purposes.Ensure the guest provides a valid method of payment (credit card, deposit, etc.).\nClarify any incidental charges or deposits that will be held during the stay.Confirm the type of room and ensure it meets the guest’s booking details and preferences.\nCheck room availability and readiness, avoiding overbooking or any confusion.Provide the guest with a room key or access card and clearly explain how to use it.Highlight any special services or ongoing promotions that might be relevant.Addressing special requests is also essential part of the check in process.Offer a personal touch, such as asking if they’re familiar with the area or if they need transportation.Wish the guest a pleasant stay, providing contact information for assistance during their stay.</p><h2>Task Breakdown</h2><p>1.As and when the guest approaches the reception desk greet the guest with the standard greeting as per the  hotel. 2.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Traces",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Creating a guest profile",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Creating a Company profile",
    "content": "<h2>Objective</h2><p>The objective of creating a company profile for a hotel is to establish a comprehensive overview that highlights the hotel’s brand, services, values, and target market. It also supports business development by showcasing the hotel's strengths and differentiators, </p><h2>Process Explained</h2><p>A company profiles gives us an insight about the company`s address and contact details. To facilitate seamless invoicing the Billing address should be added onto the company profile. Creating a company profile would help the hotel in tailoring services for corporate clients, handling group bookings, facilitating informed decision-making and fostering long-term business relationships. Company </p><h2>Task Breakdown</h2><p>1. From the opera cloud Dashboard screen select Client Relations > Select the Profiles option > Select the Manage profile option > Select the I want to… Option and click on Company profile option > Enter the desired details and click on Save.\n</p><h2>Self Check</h2><p>Once the profile is saved you may view the profile from using the search option in the Manage profiles option</p>",
    "quiz": []
  },
  {
    "title": "Creating Profile notes.",
    "content": "<h2>Objective</h2><p>The objective of creating profile notes in a hotel setting is to document key details about guests, their preferences, and specific needs to enhance service personalization. </p><h2>Process Explained</h2><p>Room Preferences: Any specific requests (e.g., bed type, floor preference, view).\nArrival Time: Record the expected arrival time to prepare for early check-ins or late arrivals.\nSpecial Requirements: Notes on accessibility needs, special accommodations (e.g., baby crib, extra pillows).\nDietary Restrictions/Preferences: Any food allergies, vegan, gluten-free, or other dietary preferences for restaurant or room service.\nCelebrations: Special occasions like birthdays, anniversaries, or milestones to acknowledge during the stay. Complaint History: If the guest has raised concerns or complaints during previous stays, ensuring these are addressed for improved service.In-room Amenities: Specific requests for room amenities like extra towels, toiletries, or a specific type of pillow.\nHousekeeping Schedule: Notes on the guest’s preferred housekeeping times (e.g., no cleaning during the day, cleaning at specific hours).</p><h2>Task Breakdown</h2><p>Adding Profile Notes\n1. From the OPERA Cloud menu, select Client Relations , Profiles , and then\nManage Profiles.\n2. Enter search criteria, click Search.\n3. Select the profile in the search result, click I Want To..., Notes or click the Notes\nlink in Profile Presentation.\n4. Click New\na. Type: Select a note type.\nb. Internal: Select this check box if the comment is to be treated as internal.Comment: Enter or paste the note details; a maximum of 4000 characters are\npermitted.\n5. Click Save.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Reservation Cancellation",
    "content": "<h2>Objective</h2><p>Reservation cancellations are an inevitable part of a hotel. By managing cancellations efficiently, we can maintain revenue stability, optimize room occupancy, and keep guests satisfied. Clear policies, transparent communication, and thoughtful handling of cancellations can enhance guest loyalty and ensure the hotel remains competitive in the market.</p><h2>Process Explained</h2><p>Proper cancellation handling helps the hotel manage room availability, optimize occupancy rates, and maintain profitability. By adjusting the booking system, the hotel can quickly fill canceled rooms with new reservations, minimizing revenue loss. || A clear cancellation policy ensures fairness for both the hotel and the guest. Guests are aware of the consequences of cancellations, while the hotel protects its revenue by enforcing the policy consistently. || Reservation cancellations, especially at the last minute, can lead to financial losses due to unoccupied rooms. A well-structured cancellation policy reduces these losses by ensuring penalties or charging fees for non-refundable bookings or last-minute cancellations. ||  compliance with consumer protection laws and regulations. The hotel must adhere to its stated cancellation policy to avoid legal issues, such as disputes over charges or non-refundable bookings. || </p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select Manage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in the search result, click I Want to... then Cancel\nReservation.\n4. Enter the following details:\na. Cancel Reason: Select a Cancellation reason.\nb. Description: Field defaults based on the reason selected; you can enter more\ndetails\nc. Delete All Traces: Select the delete reservation traces on the cancelled\nreservation.\n5. Click Cancel Reservation:\n6. The cancellation number is displayed in the confirmation panel .\n7. To generate a cancellation confirmation click Email/Print.\na. Send To: Select a linked profile from the list.\nb. Email To: Select an email address from the list\nc. Confirmation Letter: Select a cancellation template from the list to send to the guest.</p><h2>Self Check</h2><p>From the OPERA Cloud menu, select Bookings, select Reservations, and then select Manage Reservation.\nEnter search criteria, click Search. The particular reservation should reflect as cancelled.</p>",
    "quiz": []
  },
  {
    "title": "Running a NOSHOW.",
    "content": "<h2>Objective</h2><p>The objective of running a NOSHOW is to idetentify all specified pending arrivals have not showed up for checking in at the given time frame. It is essential for the front office team to identify those reservation and flag them as NOSHOW in order for the hotel to proceed with the correct flow of Cancellation/Retention process.</p><h2>Process Explained</h2><p>Identifying the guests who have not showed up to checkin at the designated time is an integral part of the process. || Arrival time for all the pending arrivals should be monitored. || Transportation requests or early morning arivals should be screened before running a reservation as a NOSHOW. || Confirmed reservations if not arriving/checking in a retention charge shall be applicable as per our hotel policy. || As per stated process the same shall be informed to the Sales/Accounts/Revenue teams once the same has been confirmed.</p><h2>Task Breakdown</h2><p>1.Proper handover should be taken for all pending arrivals from the incoming shift. 2. While running the Night audit all reservations should be screened for the arrival timing. 3.Traces and alerts should be checked for any late night or early morning arrivals. 4.While running the Night Audit process click on cancel while the reservation pops up on screen. 5.The reservation process shall run as a NOSHOW automatically.</p><h2>Self Check</h2><p>In order to self check the reservation NOSHOW refer to the NOSHOW report post the Night Audit process and the reservation shall reflect on the report.</p>",
    "quiz": []
  },
  {
    "title": "Fixed Charges posting.",
    "content": "<h2>Objective</h2><p>This process shall help the hotel to schedule any automatic posting of re-occurring\ncharges to reservations</p><h2>Process Explained</h2><p>Proper Fixed charges are established to ensure timely payments and accurate recording. || The fixed charges can include anything from Stationery for front desk or concierge - Print outs/Regular Transportation charges\nHousekeeping supplies - Extra bed requirements.\nRefreshments/snacks - Everyday Minibar replinishments.\nUpsell charges || It also offers a convenient way to automatically post a one-time charge on a specific date in\nthe future.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select\nManage Reservation.\n2. Enter search criteria for the reservation and click Search.\n3. Select a reservation in the search results.\n4. Click I Want To... and then select Fixed Charges or click the Fixed Charges link in\nReservation Presentation.\n5. Click New and enter the following details:\na. Frequency. Select the frequency with which the fixed charge should be posted.\n• Once. Post the charge one time. When this option is selected, the End Date field\nbecomes unavailable.\n• Daily. Post the charge every day.\na.. Begin Date /End Date. Select the Begin Date and End Date to determine the\nperiod when the fixed charge can be posted to the AR Account.\nb. Transaction Code. Enter or select the charge from the list.\nc. Quantity. Enter the number of units to be charged.\nd. Amount (Price). Enter the unit price of the charge.\nNote:\nFixed charges are always posted in the local/base currency for the\nproperty. The posted amount will be the price multiplied by the quantity.\ne. Supplement. Use this field for supplemental information about the charge For\nexample, for a fixed parking charge you may want to enter a parking ticket\nnumber or parking space number.\n6. Click Save or Save and Continue to add another fixed charge.</p><h2>Self Check</h2><p>Click I Want To... and then select Fixed Charges or click the Fixed Charges link\nin Reservation options and verify the fixed charge that has been applied.</p>",
    "quiz": []
  },
  {
    "title": "Managing Reservation Alerts",
    "content": "<h2>Objective</h2><p>Alerts are messages for hotel staff that are displayed as a notification when the reservation is\naccessed at a specific time (status) in the reservation life cycle.</p><h2>Process Explained</h2><p>Reservation alerts are notifications or special flags associated with a guest booking that inform hotel staff about special requests, VIP status, payment issues, or operational concerns. || These alerts help departments like Front Office, Housekeeping, and F&B to prepare in advance and deliver personalized service. || To enhance guest satisfaction by preemptively meeting expectations.\nTo inform internal departments about important guest information.\nTo ensure smooth check-in/check-out, accurate billing, and tailored services.\nTo prevent operational issues (e.g., duplicate bookings, payment denials).\n</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select Manage Reservation. 2. Enter search criteria, click Search.\n3. Select the reservation in the search result, click I Want to... then Alert or open thereservation and click Alert in Reservation Presentation.\n4. Click New and enter the following details:\n• Select the Alert message.\n• Select the area of the alert. The area determines when the alert will be displayed.\n– Reservation - Alert is triggered whenever the future reservation isaccessed.\n– Inhouse - Alert is triggered whenever the inhouse reservation is accessed\n– Check- In - Alert is triggered at the time the reservation checks in (due in)\n– Check- Out - Alert is triggered at the time the reservation checks out (due\nout)\n• The text of the alert. Based on the alert code selected , default text is populated and can be edited if required.\n• Display Alert: Select this check box to display alert as an on-screen\nnotification when the alert is triggered. This check box is selected by default\n5. Click Save.</p><h2>Self Check</h2><p>Head to the reservation alerts from the above stated options and check for the updated alert for the specific reservation.</p>",
    "quiz": []
  },
  {
    "title": "Editing/Deleting Reservation alerts",
    "content": "<h2>Objective</h2><p>Alerts are messages for hotel staff that are displayed as a notification when the reservation is\naccessed at a specific time (status) in the reservation life cycle.</p><h2>Process Explained</h2><p>Editing or deleting any reservation alerts are situational based. || Any change in the reason for the implimentation of the alert shall  be the reason for any altercation or changes in the same.</p><h2>Task Breakdown</h2><p>Editing Reservation Alert\n1. From the OPERA Cloud menu, select Bookings, select Reservations, and then\nselect Manage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in the search result, click I Want to... then Alert or open the\nreservation and click Alert in Reservation Presentation.\n4. Click Vertical Ellipse, Click Edit.\n5. Update the alert details.\n6. Click Save.\nDeleting Reservation Alert\n1. From the OPERA Cloud menu, select Bookings, select Reservations, and then\nselect Manage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in the search result, click I Want to... then Alert or open the\nreservation and click Alert in Reservation Presentation.\n4. Click Vertical Ellipse, Click Delete.\n5. Click Delete to confirm.</p><h2>Self Check</h2><p>Head to the reservation alerts from the above stated options and check for the updated alert for the specific reservation.</p>",
    "quiz": []
  },
  {
    "title": "Managing Reservation Preferences",
    "content": "<h2>Objective</h2><p>The primary objective of capturing the preferences would be to : Fulfill individual guest expectations, creating a tailored and memorable stay. || Enables different departments to proactively prepare and coordinate services. || Reflects attention to detail and world-class service, key traits of luxury hospitality. || Helps deliver consistent service across multiple visits or hotel branches.</p><h2>Process Explained</h2><p>Reservation preferences are specific requests or choices made by a guest at the time of booking or prior to arrival.\nThese preferences ensure personalized service, comfort, and guest satisfaction.\nThey can include room types, bed configuration, view, dietary needs, and other special requests. To create a tailored guest experience.\nTo ensure guest loyalty and satisfaction.\nTo streamline internal operations by allowing departments to prepare in advance.\nTo build a detailed guest profile for future visits.\n</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, then select\nManage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in search result, click I Want To... click Preferences or open the\nreservation presentation and click Preferences details link.\n4. Click New.\na. Click the preference group [+] to expand the list.\nb. Select one or preferences in the Available column, click > to move selection to the\nSelected panel.\n5. Click Save to save on reservation.\n6. Click Save to Reservation and Profile to save the preferences on reservation and also\nupdate the preferences on the linked profile.</p><h2>Self Check</h2><p>Navigate to the Manage reservations option and fill in the search criteria to find the particular reservation and head to the preference tab and self check for the saved preference. The edit option can also be used from here to make any changes in the guest preferences.</p>",
    "quiz": []
  },
  {
    "title": "Deleting Reservation Preferences",
    "content": "<h2>Objective</h2><p>the process of deleting reservation preferences is carefully managed to maintain accurate guest records and uphold service quality. Preferences may be deleted if they are outdated, incorrect, or upon guest request. Authorized personnel access the Property Management System (PMS) to locate and remove the specific preference, ensuring it doesn’t affect ongoing or future reservations. The change is saved, communicated to relevant departments if necessary, and logged for auditing.</p><h2>Process Explained</h2><p>Guest no longer requires the preference (e.g., switched from smoking to non-smoking).\n\nPreference was added in error or duplicated.\n\nGuest specifically requests deletion for privacy reasons.\n\nThe request is temporary and not relevant for future visits.\n\nData cleanup or profile maintenance by management.\n</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, then select\nManage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in search result, click I Want To... click Preferences or open the\nreservation presentation and click Preferences details link.\n4. Enter search criteria and click Search.\n5. Select the preference, click Vertical Ellipse and select Delete.\n6. Click Delete to confirm</p><h2>Self Check</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, then select\nManage Reservation.\n2. Enter search criteria, click Search.\n3. Select the reservation in search result, click I Want To... click Preferences or open the\nreservation presentation and click Preferences details and check if the preference had been deleted.</p>",
    "quiz": []
  },
  {
    "title": "Using Room Diary",
    "content": "<h2>Objective</h2><p>The objective is to have an idea to navigate and use The Room Diary search panel that shall help us to search for unassigned rooms and/or\nreservations assigned to rooms by Property, Start Date, and other optional search criterias.\nUnassigned rooms or reservations with a room assigned matching the search criteria appear\non the Room Diary. Enter a past date to view the Room Diary for past reservations.</p><h2>Process Explained</h2><p>The Room Diary in a PMS is a visual calendar or chart showing real-time room occupancy, reservations, availability, and maintenance status. || Using the Room diary should give us an idea of the below mentioned information : View daily and future room allocations.\nTrack occupied, vacant, out-of-order (OOO), or out-of-inventory (OOI) rooms\nAssign rooms manually or automatically\nPrevent overbooking or double booking</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, Reservations, and then Room Diary.\n2. Search and select a Property.\n3. Enter a Start Date for which you need to search.\n4. Use the optional fields and check boxes to apply additional search criteria to your search.\n5. Click Search.\n6. Rooms and reservations matching your search criteria appear by date on the Room Diary.\n7. Blocks with events booked in rooms can also appear in the Room Diary.\nReservations\n8. Hover your cursor over a Reservation for a brief summary of information</p><h2>Self Check</h2><p>As stated in the options we check the status of the particular room by navigating to the room diary and Hovering the cursor over a room number for a brief summary of information.</p>",
    "quiz": []
  },
  {
    "title": "Creating Walk-in / Room Reservations From Room Diary",
    "content": "<h2>Objective</h2><p>A walk-in reservation is handled with the same level of professionalism and luxury service as a pre-booked guest. When a guest arrives without a reservation, the Front Office staff checks room availability in the PMS, confirms requirements, and offers suitable room options with appropriate pricing. After verifying identity and securing payment, a reservation is created on the spot, and the guest is checked in seamlessly</p><h2>Process Explained</h2><p>As and when a guest approaches the Front Desk or Concierge.\nThe Front Office Associate greets the guest warmly and enquires about:\nNumber of guests\nPreferred room type\nNumber of nights\nAny special requirements (e.g., smoking/non-smoking, view, amenities)\nChecking for Availability and Rate quotation should be seamlessly handled by the individual processing the reservation.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, Reservations, and then Room Diary. 2. Search and select a Property. 3. Use the optional fields and check boxes to apply additional search criteria and filters to your search. 4. Click Search. 5. Rooms matching your search criteria appear by date on the Room Diary. 6. Navigate to the required room and click the Arrival Date and then click the Departure Date. 7. From the I Want to... panel select Create Reservation. 8. To create Walk in Reservation: a. Navigate to the required room and click the Arrival Date (current date) and then click the Departure Date. b. From I Want to...select Create Walk-in</p><h2>Self Check</h2><p>Navigate to the Manage reservations option and fill in the search criteria to find the particular reservation and or show checkin on the PMS</p>",
    "quiz": []
  },
  {
    "title": "Creating a Posting Master Reservation for a block",
    "content": "<h2>Objective</h2><p>An additional PM account can be required to be created where various sales charges need to be routed or transferred from individual block room reservation accounts to a 'Block master account' for settlement of all the nescessary charges.</p><h2>Process Explained</h2><p>The selected Posting Master reservation is used as a template for\nreservations created via rooming list. Reservations created inherit their attributes from the selected post master reservation You can create multiple PM templates reservations according to your needs. || A block posting is the process of group-posting charges (e.g. room rates, banquet charges, meals, etc.) to a centralized billing account called a Master Account, instead of individual guest folios it is commonly used for group bookings, corporate events, weddings, or conferences.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Blocks, and then select Manage Block.\n2. Enter search criteria, click Search..\n3. Select a Block in the search result, click I Want To . . ., and then click Posting Master.\n4. The message You are about to create an additional PM reservation. Do you wish to continue? is displayed.\n5. Click Yes.\n6. Click Go to Posting Master to launch Reservation Presentation and update the PM reservation details.</p><h2>Self Check</h2><p>Head over to the manage reservations option and check for the created Post master account by entering the details in the search criteria and self check the PM details.</p>",
    "quiz": []
  },
  {
    "title": "Checking the property Calendar",
    "content": "<h2>Objective</h2><p>The Property Calendar is a strategic tool that displays real-time room availability, rates, restrictions, and occupancy across all dates. Used by revenue managers, front office, and reservations teams, it allows the hotel to dynamically adjust prices, manage inventory, and forecast demand. This ensures optimal revenue, prevents overbooking, and aligns sales and operational strategies with business goals. By integrating with external booking platforms, the Property Calendar also helps maintain consistency and accuracy in availability and pricing across all channels.</p><h2>Process Explained</h2><p>We can use the Property Calendar to manage events or special periods that can affect rates. Here you can enter certain events which might affect your booking situation. Events can be city-wide festivals, concerts in town, property happenings, and so on. You might use this option, for example, when you are in the Control Panel and see a plus [+] beside the indicated event of the day. This means that there is more than one event on that particular day, but there is no room in the Control Panel to show you the additional events. • The Property Calendar can also be used to organize the order that your property’s rate codes display within a rate query. Day types can be used to increase/ decrease existing rates by a certain predefined factor. Day types can also be used to control the sequence of the rates in the rate grid on a daily basis. The date range option allows you to view from one day to a range of days. • The Property Calendar can be helpful in assisting guests when making reservation stay changes, or informing guests making reservations of the local events happening during their stay.</p><h2>Task Breakdown</h2><p>You can view the Property Calendar in several ways. You can select various view\nicons to change the view:\n• Day: Show only one day at a time\n• Week: Show only one week at a time\n• Month: Show one month at a time (this is the default view)\n• List: Show the calendar events as separate lines in a list || For current and future dates the Maximum Availability figure is displayed in the top left corner of each date in the monthly and list views of the calendar. Double-click the Maximum Available figure to launch the Property Availability. For more information see, Availability\npage for the selected date.</p><h2>Self Check</h2><p>Navigate to the Property calendar option and check fill in the search criteria and check the calendar to self check or double check.</p>",
    "quiz": []
  },
  {
    "title": "Managing reservation/Block Notes : Adding and Editing",
    "content": "<h2>Objective</h2><p>These notes help the hotel team coordinate personalized service, manage operational details, and ensure smooth communication across departments. Whether it's a guest's special occasion, a group’s arrival time, or billing instructions, the notes are entered by the reservations or front office team and are used to brief housekeeping, F&B, and other departments.</p><h2>Process Explained</h2><p>Reservation Notes refer to specific instructions, details, or remarks added to an individual reservation.\n\nBlock Notes refer to similar instructions or details added to a group reservation or block booking. To communicate special requests, billing details, or operational instructions to relevant departments.\n\nTo document important information about a guest or group that ensures personalized service and smooth operations. Internal Notes: Visible only to staff (e.g., VIP guest, sensitive guest history, billing instructions).\n\nExternal/Guest-Facing Notes: May appear on the guest’s registration card or confirmation (e.g., booking inclusions).\n\nBlock Notes: Instructions that apply to all reservations under a group block.\n</p><h2>Task Breakdown</h2><p>Adding Notes\n1. From the OPERA Cloud menu, select Bookings, select Block, and then select Manage\nBlocks.\n2. Search for the block.\n3. From search results, click the I Want To . . . menu and select Events. Or, from the block\npresentation screen, click Events.\n4. Search for the event.\n5. Click the row level vertical ellipsis of the event and select Add Notes.\na. The Note Type defaults to the Event Title.\nb. Enter a Note Title.\nc. Select the Internal check box if you want only internal staff to see the note.\nd. Enter a Sequence number to rank the order of appearance of the note in lists.\ne. Enter notes in the Comments field.\n6. Click Save.\nEditing Notes\n1. From the OPERA Cloud menu, select Bookings, select Block, and then select Manage\nBlocks.\n2. Search for the block.\n3. From search results, click the I Want To . . . menu and select Events. Or, from the block\npresentation screen, click Events.\n4. Search for the event.\n5. Click the notes icon in the row.\n6. Click the vertical ellipsis and select Edit for the notes to edit.\n7. Click Save.</p><h2>Self Check</h2><p>Navigate to the reservation notes by the above mentioned steps and self check the added or edited reservation/ block notes.</p>",
    "quiz": []
  },
  {
    "title": "Creating/ deleting Blocks Reservations Using Rooming List Entry",
    "content": "<h2>Objective</h2><p>To streamline group check-ins by pre-assigning rooms to individual guests within a group.\nTo ensure accurate reservation creation for each guest under the group booking.\nTo support efficient coordination between front office, reservations, housekeeping, and sales.\n</p><h2>Process Explained</h2><p>You can manually create block reservations using rooming list entry. ||\nEnsure the block has available rooms and that the block is in a status that allows for pickup; click View Room/Rate Grid to view the available rooms in the block. ||\nThe PM reservation created for the block is used as a template; reservations entered will inherit attributes from the PM reservation.\nYou can create multiple PM reservations (templates) for a Block. || Use the Change Template action link to select a different PM/template reservation for the\nrooming list. See Changing Template.\nWhen the Rate Code Mandatory for Block Pickup OPERA Control is active a rate code must\nselected for each reservation (value will default from the template reservation). || Click View Options to select the rooming list columns and their display order</p><h2>Task Breakdown</h2><p>Entering Rooming List\n1. From the OPERA Cloud menu, select Bookings, select Blocks, and then\nselect Manage Block.\n2. Enter search criteria and click Search.\n3. Select the block in the search result, click I Want To... and then click Rooming\nList.\n4. Enter the number of rows to add to the rooming list page and click Add Rows.\n5. Enter the profile and reservation details in each row - mandatory values:\na. Name: Enter a guest name to create a new profile or click to search for an\nexisting profile.\nb. Arrival Date: Enter or select the arrival date.\nc. Departure Date: Enter or select the departure date.\nd. Room Type: Enter or select the room type (from block allocation).\ne. Rate Code: Enter or select the rate code.\nf. Payment: Click to enter payment details.\ng. Deleting Rooming List\nTo delete the reservation entries on the rooming list screen prior to saving.\ni. Click Delete.\nii. Click Delete to confirm.\n6. Click Save.</p><h2>Self Check</h2><p>Self check to be done by heading to the manage reservations and the added reservations should reflect in the lists of the reservations for that particular date.</p>",
    "quiz": []
  },
  {
    "title": "Multiple reservations check-in (Mass Checkin)",
    "content": "<h2>Objective</h2><p>Mass Check In provides one easy process to check in multiple reservations for arrivals\ndue in on the property’s current business date, and to (optionally) generate their room\nkeys and registration cards.</p><h2>Process Explained</h2><p>Use Auto Assign and Check In to mass check in reservations where none or some of the reservations have room numbers assigned. This process first auto assigns rooms to the reservations without room numbers assigned, and then continues with the mass check in process for those reservations. || The reservations must be arrival (Due In) reservations for the current business date.\n• The reservations must have a valid payment method.\n• The reservations must have a room number assigned.\n• The reservations assigned rooms’ occupancy status is vacant.\n• Linked reservations can be Mass Checked In.\n• Walk In reservations, Pre Registered reservations, and reservations that are in queue can be Mass Checked In.\n• Mass Check In can be used for individuals and/or blocks</p><h2>Task Breakdown</h2><p>1. From the Room Assignment screen, select the reservations to check in, and then\nclick Mass Check In. To select all reservations, select the check box in the Select\ncolumn header.\n2. In the Mass Check In Options panel, select the room statuses to match, and then\nclick Process.\n3. In the Mass Check In Status screen, review the status, and click OK.\na. Select Print to print the status report.\nb. If any fail the mass check in, the reason is listed. You can sort the status\nresults by selecting Failures First to group the failed items first in the list.\n4. (Optional) Create the room keys.\n5. (Optional) If your property uses registration cards, you can select the card\ntemplate, select to preview/print, email, and then click Process.</p><h2>Self Check</h2><p>For a self check we need to head over to the inhouse tab and check the status of the checkins shown.</p>",
    "quiz": []
  },
  {
    "title": "Reversing Mass checkins",
    "content": "<h2>Objective</h2><p>To reverse mass checked in reservations, you need to reverse check in the individualreservation. A checked in reservation can be reversed unless financial transactions exist on\nthe folio. Reservations with deposits are eligible to be reversed. You can reverse check in a reservation from the reservation or from an In House search.</p><h2>Process Explained</h2><p>Often used for VIPs, celebrities, corporate clients, or guests arriving late or during peak check-in hours. || The feature is also used when check ins are wrongly shown on the system. </p><h2>Task Breakdown</h2><p>To Reverse a Checked In Reservation from the Reservation\n1. Open the reservation to reverse check in.\n2. Select I Want To… Reverse Check In.\n3. In the Reverse Check In panel, select whether to keep the assigned room number (Maintain Room) or to remove it (Remove Room), update the room’s housekeeping status (optional), and then select Reverse Check In.\n4. The reservation returns to Arrival status.\nTo Reverse a Checked In Reservation from an In House Search\n1. Search for the reservation from the Manage Reservation – In House search type.\n2. Select the reservation to reverse check in.\n3. Select I Want To… Reverse Check In.\n4. In the Reverse Check In panel, select whether to keep the assigned room number\n(Maintain Room) or to remove it (Remove Room), update the room’s housekeeping\nstatus (optional), and then select Reverse Check In.\n5. The reservation returns to Arrival status.</p><h2>Self Check</h2><p>Self check to be done by heading to the manage reservations and the reversed reservations should reflect in the lists of the reservations.</p>",
    "quiz": []
  },
  {
    "title": "Reverse Checkin/ Cancel Check ins.",
    "content": "<h2>Objective</h2><p>You can reverse a checked-in (that is, in-house) reservation if the reservation was checked in same day and has a zero balance (that is, no charges posted or deposit payments transferred on check-in).\nAfter reversing the check-in, the reservation reverts to the Arrival (due in) status.</p><h2>Process Explained</h2><p>A reverse checkin can shown if the reservation was checked in same day and has a zero balance (that is, no charges posted or deposit payments transferred on check-in).\nAfter reversing the check-in, the reservation reverts to the Arrival (due in) status. |</p><h2>Task Breakdown</h2><p>Reversing a Check-in\n1. From the OPERA Cloud menu, select Front Desk, and then select In House.\n2. Enter search criteria for the reservation and click Search.\n3. Select a reservation in the search results.\n4. Click I Want to… and then select Reverse Check in. The Reserve Check in prompt appears with the following Room Options:\na. Retain Room. Select to keep the room assigned for the reservation.\nb. Remove Room. Select to remove the assigned room from the reservation.\nc. Update Room Status. Select a suitable room status from the list of available options.\n5. Click Reverse Check in.</p><h2>Self Check</h2><p>To self check the reversed check in shown on system head to the manage reservations option and search for the reversed reservation. It should reflect as an arrival.</p>",
    "quiz": []
  },
  {
    "title": "Room move process",
    "content": "<h2>Objective</h2><p>The room move action is used to search for and select a new room (and possibly select a\nnew room type) for an in-house reservation. The room move feature consists of the following\nfunctionality:</p><h2>Process Explained</h2><p>The room move action is used to search for and select a new room (and possibly select a\nnew room type) for an in-house reservation. The room move feature consists of the following\nfunctionality: • Availability — When moving reservations to a new room, OPERA Cloud checks and updates the room type availability.\n• Housekeeping — When moving reservations to a new room, OPERA Cloud checks the housekeeping status of the target room similar to the way room assignment is initially handled from the reservation screen.\n• Shares — When moving a guest to another room that is occupied, you can set up a share. Similarly, when moving a reservation from a room that is being shared, you can opt to move all sharers or selected sharers.</p><h2>Task Breakdown</h2><p>1. Select the OPERA Cloud menu, select Front Desk, and then select In House.\n2. Enter search criteria and then click Search.\n3. Select the reservation from the search results and click I Want To... and select Move Room.\n4. On the Move Room screen, enter search criteria for the new (target) room and click Search. 5. Click Select Room for a suitable room listed in the search results. 7. Click Assign Room. 8. Click Select Another Room to return to the room search and select another room.\n9. Click Accept Room Selection to override warnings and continue with the room\nselection.</p><h2>Self Check</h2><p>To self check you can view the room move history : Viewing the Room Move History\n1. Enter search criteria and click Search.\n2. Select the reservation from the search results and click I Want To... and select\nMove Room.</p>",
    "quiz": []
  },
  {
    "title": "Check out",
    "content": "<h2>Objective</h2><p> The objective of the \"check-out\" process is to ensure a smooth, efficient, and courteous departure experience for guests while accurately finalizing billing and collecting feedback. This process involves settling charges, retrieving room keys or cards, and addressing any guest inquiries or concerns, all while maintaining the high service standards expected in a luxury setting. A well-managed check-out reinforces guest satisfaction and encourages repeat visits.</p><h2>Process Explained</h2><p>Guest informs the Front Desk of their intention to check out, either in person, by phone, or via in-room TV/guest app. || Front Desk staff verifies the guest’s name and room number against the system to prevent any mix-up. || All room charges, taxes, minibar usage, in-room dining, laundry, spa services, and incidental charges are reviewed and itemized. || A detailed folio (bill) is printed or shown to the guest for review.\nGuest is asked if they agree with all charges or have any questions. || Any billing discrepancies raised by the guest are resolved professionally.\nDepartments may be contacted quickly (e.g., minibar or F&B) to confirm charges. || Bell Desk assists with luggage pickup from the room or storage area.\nConcierge arranges transport, airport transfers, or taxi if needed. || Room is marked as “Checked Out” and changed to “Dirty” or “Inspection” status in the Property Management System.\nTriggers Housekeeping to clean and prepare the room for the next guest. || Front Office or Guest Relations thanks the guest by name, asks for feedback, and wishes them a pleasant journey.\nVIPs or regular guests may be personally seen off by management.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Front Desk, select Departures. You can\nalso open Departure Search from the Expected Departures figure on the Departures Tile on your Dashboard.\n2. Select a reservation from the search results and then click the Check Out button. Or click I Want to and select Check out.\n3. Depending on the Cashier, check out Workflow Preference setting. For Billing:\na. You can review and post additional charges or rebates using Post Charge:\nb. Click Check Out to settle window balances. d. To Checkout:\n• Click I Want to, click Post Charges to post charges to the reservation account.\n• Click I Want to, click Go to Billing to navigate to the Billing page.\n• Enter payment details for each window, it defaults based on payment details in routing instructions.\n• Click Settle and Send Folio to post payment and generate a folio or Settle Folio to just post the payment.\n• Repeat for balance in other Billing windows.\ne. When the balance is zero for all windows, click Checkout Now.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Out of Order rooms",
    "content": "<h2>Objective</h2><p> These rooms are temporarily removed from inventory due to maintenance, renovation, or other service needs. By accurately identifying, documenting, and addressing the reasons for a room being OOO, the hotel can minimize revenue loss, maintain high service standards, and ensure that rooms are restored to premium condition promptly for future guest use.</p><h2>Process Explained</h2><p>A room is identified as non-operational due to maintenance, safety concerns, renovations, or other reasons (e.g., broken AC, plumbing issues).\nIssue can be reported by Housekeeping, Engineering, Front Office, or a guest. || Engineering team inspects the room to assess the problem.\nEstimates time and resources needed for repair or maintenance. || Communication is important as and when Engineering or Housekeeping informs the Front Office and Reservations team about the room’s status.\nThis ensures the room is not sold or assigned to new guests. || The room status is changed from “Vacant” or “Occupied” to Out of Order (OOO) in the PMS.\nThis blocks the room from being available for bookings.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Inventory, select Room Management, and then\nselect Out of Order.\n2. Click New.\n3. Enter the search criteria and click Search.\n4. Select one or more rooms in the result.\n5. Click Set Out of Order and complete the following:\na. From Date: Select the desired dates to change the rooms' status.\nb. Nights: Add or remove number of nights for which the room needs to out of order.\nc. Through Date: The room will automatically be returned to inventory during end of\nday processing for the Through Date.\nd. Return Status: Return Status Select the status that the room(s) when returned to\nservice.\n6. Click Set Out of Order.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Out of service rooms",
    "content": "<h2>Objective</h2><p>The objective of managing \"out of service\" (OOS) rooms is to temporarily remove rooms from guest availability for minor maintenance or operational reasons without significantly affecting the hotel's inventory or revenue tracking. These rooms are typically expected to return to service quickly, and effective management ensures timely repairs, maintains safety and comfort standards, and supports seamless guest experiences while minimizing disruptions to overall hotel operations.</p><h2>Process Explained</h2><p>Minor issues or non-critical maintenance needs are detected (e.g., stained carpet, loose handle, minor leaks).\n\nCan be reported by Housekeeping, Front Office, or Engineering after room inspection. || If the issue does not impact guest safety or essential room operations, the room is marked as Out of Service (OOS) rather than Out of Order (OOO). || This temporarily removes the room from inventory but can be reinstated quickly once ready. || Engineering schedules minor repairs or touch-ups.\nThese are usually done quickly (often within the same day or a few hours). || Room status is changed from OOS to “Vacant Ready” or “Available” in the PMS.\nFront Office and Reservations team are informed for selling the room again. || The OOS event is logged with details: issue, time taken, staff involved, and resolution.\nData helps in maintenance planning and service quality review.\n</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Inventory, select Room Management, and then select Out of Service.\n2. Click New.\n3. Enter the search criteria and click Search.\n4. Select one or more rooms in the result.\n5. Click Set Out of Service and complete the following:\na. Reason: Select a reason from the list. For more information, see Out of Order and Out of Service Reason Codes.\nb. From Date: Select the desired dates to change the rooms' status.\nc. Nights: Add or remove number of nights for which the room needs to out of service.\nd. Through Date: The room will automatically be returned to inventory during end of day processing for the Through Date\ne. Return Status: Select the status that the room(s) when returned to service.\n6. Click Set Out of Service</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "On queue Reservations.",
    "content": "<h2>Objective</h2><p>The objective of managing \"on queue\" reservations in a five-star hotel is to efficiently handle guest bookings that are awaiting room availability, often due to early arrivals or high occupancy. This system ensures a smooth and organized check-in process by prioritizing room readiness and guest preferences, helping to maximize guest satisfaction and optimize room turnover. Proper queue management supports seamless front office operations and enhances the overall guest experience.</p><h2>Process Explained</h2><p>At times, guests arrive before their assigned room or a room of their chosen room type is available for assignment. The resulting backlog of arrivals can cause confusion at the front desk and adversely impact guest service. The OPERA Cloud Queue Reservations/Queue\nRooms feature is designed to help you manage room assignments and ensure guests are checked into their rooms rapidly by coordinating front desk and housekeeping efforts. || A guest with a reservation arrives at the hotel before the official check-in time (e.g., before 2:00 PM).\nThe room is not yet ready or currently occupied. || Housekeeping and Front Office prioritize the cleaning or preparation of a suitable room.\nThe “on queue” guest is placed in line for the next available room in their reserved category.\n</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Front Desk and then select Arrivals.\n2. Enter search criteria and click Search.\n3. Select the reservation from the search results, click the I Want To . . . menu, and select Place Reservation in Queue. \n4. When the confirmation appears, click OK</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Creating a walk in reservation",
    "content": "<h2>Objective</h2><p>The objective of creating a walk-in reservation is to efficiently accommodate guests who arrive without prior bookings by providing immediate service that meets luxury standards. This involves quickly assessing room availability, verifying guest details, and offering suitable options while maintaining a high level of professionalism and hospitality. Proper handling of walk-in reservations helps maximize occupancy, generate additional revenue, and enhance guest satisfaction through personalized, prompt service.</p><h2>Process Explained</h2><p>A guest arrives at the hotel without a prior reservation and requests a room on the spot. || Available room types and rates are checked and informed to the guest. || Upselling may be done as per hotel policy (e.g., higher category room, breakfast package). || Valid government-issued photo ID/passport is collected and verified as per legal requirements.\nGuest registration details are entered into the PMS. || Payment is collected (as per hotel policy) — either a full stay charge or a security deposit.\nPre-authorization may be taken on a credit card. || </p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select\nLook To Book Sales Screen.\n2. Enter the caller and/or contact information (if applicable) and then click New Reservation.\n3. In the search panel enter the various criteria.\na. Single Rate: Click to create a single leg reservation (default).\nb. Multi-segment: Click to create a multi-leg reservation.\ni. Click Add Leg to add additional dates to the reservation.\nc. Stay Options:\ni. Arrival: Enter or select the arrival date.\nii. Nights: Enter the number of nights; the departure date is updated.\niii. Departure: Enter or select the departure date.\niv. Rooms: Enter the number of rooms required; a multi-room reservation needs to be split into separate reservations prior to arrival. v. Adults: Enter the number of adults in the room.\nvi. Children: Enter the children in the room.\nd. Profile Options\ni. Name: Click to search for an existing guest profile.\nii. New Profile: Click to create a new guest profile.\nand click on save.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Reservation attachments",
    "content": "<h2>Objective</h2><p>The objective of managing reservation attachments is to accurately store and organize important documents or notes related to a guest’s booking, such as special requests, payment authorizations, travel itineraries, or identification copies. These attachments support personalized service, ensure compliance with hotel policies, and facilitate smooth coordination between departments. Proper handling of reservation attachments enhances operational efficiency and helps deliver a seamless and tailored guest experience.</p><h2>Process Explained</h2><p>Locate the guest's reservation in the Property Management System (PMS) using guest name, confirmation number, or stay dates. || Select the document type from a predefined list (e.g., ID Proof, Travel Voucher, Payment Authorization).\nAdd a brief description for easy identification (e.g., “Guest Passport – John Smith”). || \nEnsure the document appears in the list of attached files.\nCheck file visibility and open to confirm it displays correctly. || Ensure sensitive attachments are only viewable by authorized staff.\nFollow data privacy protocols (e.g., GDPR, PCI DSS) for guest information.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select Manage Reservation.\n2. Enter search criteria and click Search.\n3. Select the reservation in search result, click I Want To. . ., click Attachments or open the reservation and click the Attachments details link.\n4. Click New to attach a new file.\na. Click Browse and select a file on your workstation.\nb. Filename. Enter a filename using only alphanumeric characters; no spaces or special characters are accepted.\nc. Description Enter a description for the attachment.\n5. Click Save.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Reservation Packages identification",
    "content": "<h2>Objective</h2><p>The objective of managing reservation packages is to offer guests bundled services—such as dining, spa treatments, or excursions—along with their room booking, providing added value and enhancing the overall experience. These packages are designed to attract specific guest segments, boost revenue, and promote the hotel’s premium amenities. Efficient handling and clear communication of reservation packages ensure guest satisfaction and operational excellence across departments.</p><h2>Process Explained</h2><p>Package items enable you to provide guests with amenities and services as part of their reservation stay. You can link package items to a rate code to create a package rate, sell package items directly on a reservation, or both link them to a rate code and sell them on a reservation. || Hotel creates special packages (e.g., Honeymoon Package, Spa Package, Weekend Getaway) including room and value-added services.\nPackages are tailored to the hotel's brand and guest segment (luxury, business, leisure, etc.). || Revenue/Reservations team sets up the package in the Property Management System (PMS) with:\nPackage name and code\nIncluded services (e.g., breakfast, massage, airport pickup)\nPricing components (room rate + package elements)\nValidity dates and applicable room types || Relevant departments (F&B, Spa, Transport, Housekeeping) are notified of package inclusions via PMS reports or internal communication tools.\nEnsures service delivery (e.g., welcome drink, dinner, spa slot booking).</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select Manage Reservation.\n2. Enter search criteria and click Search.\n3. Select the reservation in the search results, click I Want To… and then select Packages or click the Packages link in Reservation Presentation. The Selected Packages panel displays a list of the included package items:\na. Price: Shows the package price b.Quantity C. Calculated Quantity</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Advance Bill",
    "content": "<h2>Objective</h2><p>The objective of the Advance Folio is to streamline and secure the pre-arrival billing process by recording all expected charges and payments for a guest before check-in. This allows for efficient financial tracking, minimizes discrepancies at checkout, and ensures a seamless guest experience. It supports transparent communication between departments such as front office, reservations, and accounting, while also enhancing guest satisfaction by reducing billing delays or confusion during their stay.</p><h2>Process Explained</h2><p>When a guest makes a reservation, the hotel confirms the booking through email or phone, and a reservation folio is prepared in advance. || The hotel may require an advance deposit or pre-authorize a credit card to guarantee the booking. This is recorded in the folio. || Expected room charges, taxes, and known add-ons (e.g., airport transfer, meal plan) are posted in advance into the folio. || You can generate interim bills or advance bills using the Generate a Folio function.\nAn Interim Folio shows you the guest's outstanding charges up to the present. You can post charges and accept payments. You can review credit card authorizations and history. You also can view routing instructions and move payment methods. An Advance Bill allows you to apply fixed charges to the guest’s bill in advance. This includes room and tax or service charges.\nFor example, a guest with a Sunday check out requests an Advance Bill on Saturday morning. The Advance Bill would include Saturday night’s fixed charges for room and tax.\nOn an Advance Bill, you can apply charges for the current night, several nights, or the entire stay.</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Bookings, select Reservations, and then select\nManage Reservation.\n2. Search for and open a reservation.\n3. Click I Want To . . . and then click Billing.\n4. Click I Want To . . . and then click Advance Bill.\n5. Select either Tonight, Nights to Charge (enter a number of nights), or Entire Stay and\nclick Apply Advance Charges to settle the folio and generate the Advance Bill.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Quick Checkout process",
    "content": "<h2>Objective</h2><p>The objective of the Quick Check-Out is to provide guests with a fast, hassle-free departure experience by allowing them to settle their bills and complete check-out procedures without waiting in line at the front desk. This service enhances guest convenience and satisfaction, particularly for business travelers or early departures, while also improving operational efficiency and reducing front office congestion during peak hours.</p><h2>Process Explained</h2><p>Quick Check Out is a fast way to check out reservations when the payment method is credit\ncard or direct bill or the reservation has a zero balance To ensure a successful Quick Check Out:\n• Make sure the guest's credit card has sufficient authorization to cover the balance.\n• Make sure Direct Bill AR accounts are not restricted and have not exceeded credit limits.\n• Make sure cash guest folios have a zero balance</p><h2>Task Breakdown</h2><p>1. From the OPERA Cloud menu, select Front Desk , select Front Desk\nWorkspace, and then select Quick Check Out.\n2. Enter search criteria then click Search.\n3. Select the Table or List view\n4. Select multiple reservations in the search result then click Mass Check Out.\n5. Folio Settlement appears for the first reservation\na. Enter payment details\nb. Click Settle and Send Folio.\ni. Report Destination\ni. Select a Folio Style.\nii. Select a Report Destination.\niii. Click Process.\nc. Click Check Out Now to check out the reservation or click Schedule Check Out to schedule the check out for a later time. For more information, see Scheduling a Checkout.\nd. Select a room status.\ne. Click Save.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Dashboard Pages",
    "content": "<h2>Objective</h2><p>The objective of managing dashboard effeciently is to make navigating to various menues flawlessly.</p><h2>Process Explained</h2><p>You can add pages to your Home Dashboard to categorize and organize tiles for different roles or other requirements. Each page is given a descriptive name to differentiate it from the other pages. For example, you could have two pages on your Home Dashboard, one called\nFront Desk for Arrival, Departure and In-house tiles and a second page called Housekeeping for Queue Rooms, Task Sheet, Room Status and Maintenance tiles.</p><h2>Task Breakdown</h2><p>Adding Dashboard Pages\n1. From the OPERA Cloud dashboard screen, click the Add Page button.\n2. Enter a name for the new page and click Save.\n3. The new page appears in the tabbed page list on the Home Dashboard. || Editing Dashboard Pages\n1. Click the vertical ellipses icon for the page you wish to edit.\n2. Click Edit.\n3. Enter the new page name, and then click Save. || Deleting Dashboard Pages\n1. Click the vertical ellipses icon for the page you wish to remove.\n2. Click Delete.\n3. Confirm your removal by clicking Delete on the pop-up confirmation window</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Early checkout reservations.",
    "content": "<h2>Objective</h2><p>The early checkout process is designed to be efficient and guest-friendly. Guests typically inform the front desk in advance of their intention to leave before the standard checkout time. The hotel then prepares the final bill in advance, including all charges incurred during the stay.</p><h2>Process Explained</h2><p>There might be occaission / emergencies / itinerary changes for a guest wherein which the guests would want to modify their reservation and decrease the number of days for their stay. || </p><h2>Task Breakdown</h2><p>Use Check Out Early to check out reservations prior to their due departure date. The Check\nOut Early option appears only when the reservation departure date is later than your current\nbusiness date. OPERA Cloud follows the Check Out Workflow Preference OPERA Control to\nprocess the early departure.\n1. From the OPERA Cloud menu, select Front Desk, select In House.\n2. Enter search criteria and click Search.\n3. Select the reservation in the results and click I Want To... and select Check Out Early.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Batch Registration Cards",
    "content": "<h2>Objective</h2><p>The batch registration cards process is used to streamline check-in for groups or large delegations. Prior to arrival, the hotel prepares registration cards for all group members in advance, based on details provided by the organizer or travel agent. Minimizing wait times and enhancing the efficiency and professionalism of the front desk service.</p><h2>Process Explained</h2><p>As well as generating registration cards \"on-demand\" for arrivals, you can also generate registration cards, in advance, in a batch process. For example, this is useful for group arrivals where key packets containing a registration card are prepared in advance. || The Batch Registration Card screen offers a variety of filter options to select the\nspecific reservations and/or profiles for which you want to generate a registration card. You may also generate registration cards for pseudo room type reservations if needed. || </p><h2>Task Breakdown</h2><p>Generating Registration Cards\n1. From the OPERA Cloud menu, select Front Desk, select Front Desk Workspace then select Registration Cards\n2. Enter reservation and profile search criteria and click Search.\n3. Sort by: Click to select a different sort order from the list.\n4. Select the reservations in the search result and click Process Registration Card.\nNote:\nTo select all reservations listed click the checkbox in the column titles.\n5. Enter the following details:\na. Select the Registration Cards and click on print.</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Viewing Floor Plans",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check out process for Company guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Checking High Balance guests",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Transferring Transactions",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Viewing a POS check",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Block wash",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Petty Cash Process",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "IOU Process",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "City Tour Package requests",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Restaurants Booking in and around hotel vicinity",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Flight Bookings",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Airport Drop",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Airport Pickup",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Car Hire Local Run",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Web Checkin for guests",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Key making Process",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Escorting guests to the lounge",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Welcoming guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Guest Messages.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Pre Arrival Screening",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Amenities",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Making Group Billing Grid.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Night Audit Process on opera",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "GST breakdown",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Upselling",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Transferring calls External and internal",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Raising a request on hotlync",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Raising a requisition.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Maintaining cleanliness in back of the house areas.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Delivering guest luggages in the room.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Storing left luggages in LLR.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Safety Deposite lockers process",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Processing a reservation",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Updating guest profiles",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Dashboard",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check in process for group guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check in process for Travel agent guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check in process for Company guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check out process for FIT travelers.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check out process for group guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Check out process for Travel agent guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Closing shift cash.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Cash handover Taking",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Cash handover to next shift",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Wake up Calls",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Packed breakfast requests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Foreign Currency Exchange",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Cash Collection from guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Pre authorization collection and posting.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Conversion of Pre Auth into a Sale.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Making C forms",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Handling Guest Complaints",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Updating Incident Report",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Updating Regcards.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Group IDs handling",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Upselling",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "First Aid assistance for guests.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Lost and found process.",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  },
  {
    "title": "Managing Alerts",
    "content": "<h2>Objective</h2><p>nan</p><h2>Process Explained</h2><p>nan</p><h2>Task Breakdown</h2><p>nan</p><h2>Self Check</h2><p>nan</p>",
    "quiz": []
  }
]